# FamilyId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySymbolFilter..::..FamilyId Property
FamilySymbolFilter Class See Also
---
The family id.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElementId FamilyId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FamilyId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ FamilyId {
	ElementId^ get ();
}
```

# See Also
FamilySymbolFilter Class
Autodesk.Revit.DB Namespace